Repository: brokensmile2103/init-content-protector
Catalog: languages/init-content-protector-*.po
Languages: vi

source: A lightweight plugin to protect your post content from copy, scraping, and inspection. Features include copy protection, keyword cloaking, noise injection, and full content encryption.
vi: Một plugin nhẹ giúp bảo vệ nội dung bài viết của bạn khỏi bị sao chép, quét dữ liệu và kiểm tra. Các tính năng bao gồm bảo vệ sao chép, ẩn từ khóa, chèn nhiễu và mã hóa toàn bộ nội dung.

source: Init Content Protector Settings
vi: Cài đặt Init Content Protector

source: Content Protection
vi: Bảo vệ Nội dung

source: Content Protection Mode
vi: Chế độ Bảo vệ Nội dung

source: No Protection
vi: Không bảo vệ

source: Encrypt Content (decode via JS)
vi: Mã hóa nội dung (giải mã bằng JavaScript)

source: Encrypting the content helps prevent crawlers from reading raw HTML. Do not enable if you need SEO access.
vi: Việc mã hóa nội dung giúp ngăn crawler đọc HTML gốc. Không nên bật nếu bạn cần SEO truy cập vào nội dung.

source: Enable JavaScript Content Protection
vi: Bật bảo vệ nội dung bằng JavaScript

source: Block printing, prevent right-click and text selection, and interfere with browser developer tools.
vi: Chặn in nội dung, vô hiệu hóa chuột phải và chọn văn bản, gây nhiễu công cụ phát triển trình duyệt.

source: Blocks copying, selecting, printing, and inspecting content via JS. Includes right-click disable, keyboard shortcut blocking (Ctrl/⌘ + C, P, U, etc.), and DevTools interference.
vi: Chặn sao chép, chọn, in và kiểm tra nội dung bằng JavaScript. Gồm cả việc vô hiệu hóa chuột phải, chặn phím tắt (Ctrl/⌘ + C, P, U, v.v.), và gây nhiễu công cụ DevTools.

source: Inject Noise
vi: Chèn từ nhiễu

source: Insert invisible junk spans randomly to confuse crawlers.
vi: Chèn các đoạn mã vô hình vào ngẫu nhiên để gây nhiễu crawler.

source: Invisible to real readers. Junk spans use display: none.
vi: Không ảnh hưởng đến người đọc thật. Các đoạn chèn sẽ bị ẩn bằng CSS.

source: Sensitive Keywords to Obscure
vi: Từ khóa nhạy cảm cần làm mờ

source: Enter keywords to hide. Separate by commas. Example: <code>dragon ball,one piece,naruto</code>
vi: Nhập các từ khóa cần ẩn, phân cách bằng dấu phẩy. Ví dụ: <code>dragon ball,one piece,naruto</code>

source: These will be replaced visually using CSS pseudo-elements and hidden from raw HTML.
vi: Chúng sẽ được thay thế bằng CSS (pseudo-element) và không xuất hiện trong mã HTML gốc.

source: Apply Protection to Post Types
vi: Áp dụng bảo vệ cho Post Type

source: Choose which post types to apply content protection to.
vi: Chọn post type cần áp dụng bảo vệ nội dung.

source: Custom Encryption Key
vi: Khóa mã hóa tùy chỉnh

source: Use a unique key for this website. Leave blank to use default key from plugin constant.
vi: Hãy dùng một khóa duy nhất cho website này. Để trống nếu muốn dùng khóa mặc định của plugin.

source: Content Selector (for JS injection)
vi: CSS Selector vùng nội dung (dùng cho JS)

source: CSS selector to locate content wrapper. Used for decryption and JS protection. Example: <code>.entry-content</code>
vi: CSS selector để xác định vùng bao nội dung. Dùng để giải mã và áp dụng bảo vệ bằng JavaScript. Ví dụ: <code>.entry-content</code>

source: Important Notes When Using This Plugin:
vi: Các lưu ý quan trọng khi sử dụng plugin này:

source: Use encryption only if you understand its impact on SEO, caching, and content accessibility.
vi: Chỉ sử dụng chế độ mã hóa khi bạn hiểu rõ ảnh hưởng của nó đến SEO, bộ nhớ đệm và khả năng truy cập nội dung.

source: JavaScript protection relies on client-side execution. It can be bypassed by experienced users.
vi: Bảo vệ bằng JavaScript hoạt động phía người dùng và có thể bị vượt qua bởi người dùng có kinh nghiệm.

source: For best results, combine multiple protection layers (encryption, JS, keyword cloaking).
vi: Để đạt hiệu quả tối ưu, nên kết hợp nhiều lớp bảo vệ (mã hóa, JS, làm mờ từ khóa).

source: This plugin does not prevent content theft 100%. It raises the difficulty level for scraping.
vi: Plugin này không thể ngăn chặn 100% hành vi sao chép nội dung. Nó chỉ giúp tăng độ khó cho các công cụ quét nội dung.
